feat(d2); replaced mermaid with d2.
Thanks @gedw99
