--- a/pages/blog/2023-10-09-understanding-authentication/page.md
+++ b/pages/blog/2023-10-09-understanding-authentication/page.md
@@ -48,13 +48,13 @@ So what if we were to dedicate authentication to a service? Well, let's talk abo
 
 <center>
 
-```mermaid
-sequenceDiagram
-    OAuth2 Application->>User: 1. Ask for authorization.
-    User->>OAuth2 Application: 2. Authorize application (code is given with specific URL). (/callback)
-    OAuth2 Application ->> Authorization Server: 3. Check code.
-    Authorization Server ->> OAuth2 Application: 4. Returns Access Token.
-    OAuth2 Application ->> API: 5. Authenticated request.
+```d2
+shape: sequence_diagram
+    OAuth2 Application -> User: 1. Ask for authorization.
+    User -> OAuth2 Application: 2. Authorize application (code is given with specific URL). (/callback)
+    OAuth2 Application -> Authorization Server: 3. Check code.
+    Authorization Server -> OAuth2 Application: 4. Returns Access Token.
+    OAuth2 Application -> API: 5. Authenticated request.
 ```
 
 </center>
